using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//Создайте класс, который позволит выполнять мониторинг ресурсов, используемых программой.
//Используйте его в целях наблюдения за работой программы, а именно: пользователь может
//указать приемлемые уровни потребления ресурсов(памяти), а методы класса позволят выдать
//предупреждение, когда количество реально используемых ресурсов приблизиться к максимально допустимому уровню

namespace Task2
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
